000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователей/ОповещенияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияПользователей</name>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Копия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытаяКопия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.НастройкиБотов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ТипыСобытийОповещений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОповещения</name>
    <type>
      <types>EnumRef.СпособыОповещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияПользователей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устаревшее. Используется для обратной совместимости. Используйте ОповещенияПользователей.ВыполнитьОповещениеПользователей()
//
Процедура ВыполнитьОповещение(Событие, СсылкаНаОбъект = Неопределено, ТелоСообщения = "", ТипТекста = "") Экспорт
	
	ОповещенияПользователей.ВыполнитьОповещение(Событие, СсылкаНаОбъект, ТелоСообщения, ТипТекста);
		
КонецПроцедуры

// Устаревшее. Используется для обратной совместимости. Используйте ОповещенияПользователей.ВыполнитьПроизвольноеОповещениеПользователей()
//
Процедура ВыполнитьПроизвольноеОповещение(Получатель, Тема = "", Текст = "", Копии = Неопределено, СкрытыеКопии = Неопределено) Экспорт
		
	ОповещенияПользователей.ВыполнитьПроизвольноеОповещение(Получатель, Тема, Текст, Копии, СкрытыеКопии);
		
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
